{
    "display_name_english": "Thai",
    "display_name_native": "ไทย",
    "contributors": [
        {
            "username": "ITSVFATZXD",
            "account-id": 30880677,
            "icon-id": 55,
            "primary-col": 15,
            "secondary-col": 11,
            "glow-enabled": false,
            "glow-col": 0,
            "death-effect-id": 0
        }
    ],
    "strings": {
        "Level": "ระดับ",
        "Universal": "สากล",
        "Creator": "ผู้สร้าง",
        "Cosmetic": "เครื่องสำอาง",
        "Icon Effects": "ไอคอนเอฟเฟกต์",
        "Speedhack": "แฮ็คความเร็ว",
        "Labels": "ป้ายกำกับ",
        "Config": "การกำหนดค่า",
        "Noclip": "ทะลุ",
        "Tint on death": "สีสันแห่งความตาย",
        "Tint Opacity:": "ความทึบของสี:",
        "Tint Colour:": "เฉดสี:",
        "Minimum Accuracy": "ความแม่นยำขั้นต่ำ",
        "Min Accuracy:": "ความแม่นยำขั้นต่ำ:",
        "Player 1": "ผู้เล่น1",
        "Player 2": "ผู้เล่น2",
        "Instant Complete": "เสร็จสิ้นทันที",
        "Confirm Practice": "ยืนยันการปฏิบัติ",
        "Confirm Restart": "ยืนยันการรีสตาร์ท",
        "StartPos Switcher": "สวิตช์ตำแหน่งสตาร์ท",
        "Opacity:": "ความทึบ:",
        "Smart StartPos": "สมาร์ทสตาร์ตพอส",
        "Custom Respawn Time": "เวลาแห่งการเกิดใหม่ที่กำหนดเอง",
        "Delay:": "ล่าช้า:",
        "Instant Restart": "เกิดใหม่ทันที",
        "Show Hitboxes": "แสดงการชนกัน",
        "Solid's Colour:": "สีของวัตถุที่เป็นของแข็ง:",
        "Hazards's Colour:": "สีแห่งความอันตราย:",
        "Passable Colour:": "สีของวัตถุที่เป็นของแข็ง:",
        "Interactable:": "แบบโต้ตอบ:",
        "Player:": "ผู้เล่น:",
        "Player (Rotated):": "ผู้เล่น (หมุนแล้ว):",
        "Hitbox Trail": "ร่องรอยการชนกัน",
        "Thicker Outline": "โครงร่างหนาขึ้น",
        "Fill Hitbox": "เติมชนกัน",
        "Fill Opacity:": "เติมความทึบ:",
        "Show Hitboxes On Death": "แสดงการชนกันเมื่อเสียชีวิต",
        "Force Platformer": "โหมด Platformer บังคับ",
        "Coin Finder": "เครื่องมือค้นหาเหรียญ",
        "Line Colour:": "สีของเส้น:",
        "No Mirror Portal": "ไม่มีพอร์ทัลมิเรอร์",
        "Instant Mirror Portal": "พอร์ทัลกระจกทันที",
        "Accurate Percentage": "เปอร์เซ็นต์ที่แน่นอน",
        "Decimal Places:": "จำนวนตำแหน่งทศนิยม:",
        "Classic Percentage": "เปอร์เซ็นต์คลาสสิก",
        "Show Layout": "แสดงเค้าโครง",
        "Keep Camera Triggers": "บันทึกทริกเกอร์กล้อง",
        "BG Colour:": "สีพื้นหลัง:",
        "Ground Colour:": "สีเอิร์ธโทน:",
        "Show Triggers": "แสดงทริกเกอร์",
        "Quests in Pause": "ภารกิจในหยุดชั่วคราว",
        "Show Trajectory": "แสดงเส้นทางการเคลื่อนที่",
        "All Modes Platformer": "ทุกโหมดใน Platformer",
        "Random Seed": "เม็ดสุ่ม",
        "Seed:": "เมล็ด:",
        "Conditional Auto-Retry": "",
        "Auto Practice Mode": "โหมดฝึกซ้อมอัตโนมัติ",
        "Kill at %": "ฆ่าตอน %",
        "Percent:": "เปอร์เซ็นต์:",
        "Time:": "เวลา:",
        "Jump Hack": "กระโดดแฮ็ค",
        "Pause Countdown": "หยุดนับถอยหลัง",
        "1 Attempt Practice": "ฝึกฝนด้วยความพยายาม 1 ครั้ง",
        "Best In Percentage": "ดีที่สุดในเปอร์เซ็นต์",
        "Auto Collect Coins": "เก็บเหรียญอัตโนมัติ",
        "Suicide": "ฆ่าตัวตาย ",
        "No Checkpoint Limit": "ไม่มีจุดตรวจจำกัด",
        "Auto Clicker": "คลิกอัตโนมัติ",
        "Interval": "ช่วงเวลา",
        "Hold For": "กดค้างไว้",
        "Stop Triggers on Death": "หยุดทริกเกอร์เมื่อตาย",
        "Frame Stepper": "เฟรมสเต็ปเปอร์",
        "unused": "ไม่ได้ใช้",
        "Allow Pause Buffering": "อนุญาตให้บัฟเฟอร์หยุดชั่วคราว",
        "Force Hide Player": "บังคับซ่อนผู้เล่น",
        "Force Show Player": "บังคับแสดงผู้เล่น",
        "Hitbox Multiplier": "ตัวคูณฮิตบ็อกซ์",
                "Player": "ผู้เล่น",
        "Solid": "ของแข็ง",
        "Hazard": "อันตราย",
        "Freeze Attempts": "ความพยายามหยุดนิ่ง",
        "No Static Camera": "ไม่มีกล้องนิ่ง",
        "Legacy Upside Down Physics": "ฟิสิกส์คว่ำหน้าแบบเดิม",
        "Icon Kit in Pause": "ชุดไอคอนในช่วงหยุดชั่วคราว",
        "Practice Music Sync": "การซิงค์เพลงฝึกหัด",
        "Unlock All Icons": "ปลดล็อกไอคอนทั้งหมด",
        "Music Customiser Bypass": "ข้ามตัวปรับแต่งเพลง",
        "Fire in the hole!": "ไฟในหลุม!",
        "Auto Safe mode": "โหมดปลอดภัยอัตโนมัติ",
        "Safe mode": "โหมดปลอดภัย",
        "Character Limit": "จำกัดอักขระ",
        "Character Filter": "ตัวกรองอักขระ",
        "Main Levels": "ระดับหลัก",
        "Tower Levels": "ระดับหอคอย",
        "Auto Song Download": "ดาวน์โหลดเพลงอัตโนมัติ",
        "Full Options Menu": "เมนูตัวเลือกทั้งหมด",
        "Physics Bypass": "ข้ามฟิสิกส์",
        "Ticks:": "เครื่องหมายถูก:",
        "Comment History Bypass": "ข้ามประวัติความคิดเห็น",
        "Slider Limit Bypass": "บายพาสขีดจำกัดตัวเลื่อน",
        "Transition Customiser": "เครื่องมือปรับแต่งการเปลี่ยน",
        "": "Sub to VFATZ_CH",
        "Pitch Shifter": "ตัวเปลี่ยนระดับเสียง"
        "Pitch:": "ระดับเสียง"
        "No Short Numbers": "ไม่มีตัวเลขสั้น"
        "Show Touches": "แสดงการสัมผัส"
        "Auto LDM": "LDM อัตโนมัติ"
        "Hide Pause Menu": "ซ่อนเมนูหยุดชั่วคราว"
        "Treasure Room Bypass": "บายพาสห้องสมบัติ"
        "Vault Of Secrets Bypass": "บายพาสห้องนิรภัยแห่งความลับ"
        "The Challenge Bypass": "บายพาสความท้าทาย"
        "Basement Bypass": "บายพาสห้องใต้ดิน"
        "Basement Key Bypass": "บายพาสกุญแจห้องใต้ดิน"
        "Treasure Room Chest Bypass": "บายพาสห้องสมบัติ"
        "Unlock All Gauntlets": "ปลดล็อกถุงมือทั้งหมด"
        "December Menu Snow": "เมนูเดือนธันวาคม หิมะ"
        "End Screen Cheat Indicator": "ตัวบ่งชี้การโกงหน้าจอสุดท้าย"
        "Copy Hack": "คัดลอกแฮ็ก"
        "Show Level Password": "แสดงรหัสผ่านระดับ"
        "No Copy Mark": "ไม่คัดลอกเครื่องหมาย"
        "Level Edit": "Level แก้ไข",
        "Verify Hack": "ยืนยันการแฮ็ก",
        "Default Song Bypass": "ข้ามเพลงเริ่มต้น",
        "Free Scroll": "เลื่อนฟรี",
        "No Custom Object Limit": "ไม่มีขีดจำกัดวัตถุที่กำหนดเอง",
        "Editor Wave Trail": "เส้นทางคลื่นของตัวแก้ไข",
        "Smooth Editor Trail": "เส้นทางการแก้ไขที่ราบรื่น",
        "Editor Extension": "ส่วนขยายตัวแก้ไข",
        "Toolbox Button Bypass": "ข้ามปุ่มกล่องเครื่องมือ",
        "Scale Input": "อินพุตมาตราส่วน",
        "Reset Percentage On Save": "รีเซ็ตเปอร์เซ็นต์เมื่อบันทึ",
        "No Transition": "ไม่มีการเปลี่ยนผ่าน",
        "No Camera Shake": "ไม่มีการสั่นของกล้อง",
        "No Shaders": "ไม่มีเชเดอร์",
        "No Death Effect": "ไม่มีเอฟเฟกต์การตาย",
        "No Wave Trail": "ไม่มีเส้นทางคลื่น",
        "Solid Wave Trail": "เส้นทางคลื่นที่มั่นคง",
        "Transparent BG": "พื้นหลังโปร่งใส",
        "Transparent Lists": "รายการโปร่งใส",
        "Force Trail On": "บังคับให้เปิดเส้นทาง",
        "Force Trail Off": "บังคับให้ปิดเส้นทาง",
        "Force Ghost On": "บังคับให้เปิด Ghost",
        "Force Ghost Off": "บังคับให้ปิด Ghost",
        "No Glow": "ไม่มีแสง",
        "No Respawn Blink": "ไม่มีการกะพริบตาเพื่อฟื้นคืนชีพ",
        "No Circles": "ไม่มีวงกลม",
        "No Wave Pulse": "ไม่มีคลื่นพัลส์",
        "Pulse Size:": "ขนาดพัลส์:",
        "Pulse Menu": "เมนูพัลส์",
        "No \"Do Not\" flip": "ไม่มี \"ห้าม\" พลิก",
        "No Player Rotation": "ไม่มีการหมุนของผู้เล่น",
        "No Particles": "ไม่มีอนุภาค",
        "Hide Level": "ซ่อนระดับ",
        "Unlock Buttons": "ปุ่มปลดล็อค",
        "No Wave Reset": "ไม่มีการรีเซ็ตคลื่น",
        "No Orb Pulse": "ไม่มีคลื่นพัลส์",
        "Main Menu Gameplay": "เมนูหลักสำหรับการเล่นเกม",
        "Hide Pause Button": "ซ่อนปุ่มหยุดชั่วคราว",
        "Coins In Practice": "เหรียญในการฝึกซ้อม",
        "No Robot Fire": "ไม่มีหุ่นยนต์ยิง",
        "No Spider Dash Effect": "ไม่มีเอฟเฟกต์การพุ่งของแมงมุม",
        "Longer Trail": "เส้นทางยาวกว่า",
        "No Dash Fire": "ไม่มีการยิงพุ่ง",
        "Gold User Coins": "เหรียญผู้ใช้ทองคำ",
        "No Ship Fire": "ไม่มีเรือยิง",
        "Ball Rotation Bug": "ข้อผิดพลาดการหมุนลูกบอล",
        "No Trail Blending": "ไม่มีการผสมผสานของเส้นทาง",
        "Percentage Level Font": "แบบอักษรระดับเปอร์เซ็นต์",
        "No Plat Jump Anim": "ไม่มีแอนิเมชั่นการกระโดดของแพลตฟอร์ม",
        "No Lightning": "ไม่มีสายฟ้า",
        "Speed": "ความเร็ว",
        "Enabled": "เปิดใช้งาน",
        "Speedhack Music": "เพลง Speedhack",
        "Gameplay Only": "เฉพาะการเล่นเกม",
        "Search Box": "ช่องค้นหา",
        "Additional Border": "ขอบเพิ่มเติม",
        "Blur Background": "พื้นหลังเบลอ",
        "Hide Button": "ปุ่มซ่อน",
        "Draggable Button": "ปุ่มลากได้",
        "Save Button Position": "ตำแหน่งปุ่มบันทึ",
        "Instant Button Fade": "ปุ่มจางลงทันท",
        "Prevents the player from dying": "ป้องกันไม่ให้ผู้เล่นตาย",
        "Tints the screen red when you die in noclip": "ทำให้หน้าจอเป็นสีแดงเมื่อคุณตายใน noclip",
        "Allows you to die if your noclip accuracy drops below this value": "อนุญาตให้คุณตายได้หากความแม่นยำของ noclip ของคุณลดลงต่ำกว่าค่านี้",
        "Apply noclip to player 1": "นำ noclip ไปใช้กับผู้เล่น 1",
        "Apply noclip to player 2": "นำ noclip ไปใช้งาน ถึงผู้เล่น ",
        "Instantly completes a level.\nMay not work because of the <cg>Geometry Dash</c> anti-cheat.\nUsing this cheat on a <co>rated level</c> <cr>WILL GET YOU LEADERBOARD BANNED</c>": "ผ่านด่านทันที\nอาจใช้ไม่ได้เนื่องจากโปรแกรมป้องกันการโกง <cg>Geometry Dash</c>\nการใช้โปรแกรมโกงนี้กับด่าน <co>ที่ได้รับการจัดอันดับ</c> <cr>จะทำให้คุณถูกแบนจากลีดเดอร์บอร์ด</c></c>",
        "Adds a popup to confirm if you want to enter practice mode": "เพิ่มป๊อปอัปเพื่อยืนยันว่าคุณต้องการเข้าสู่โหมดฝึกฝน",
        "Adds a popup to confirm if you want to restart the level": "เพิ่มป๊อปอัปเพื่อยืนยันว่าคุณต้องการเริ่มด่านใหม่",
        "Switch between start positions in levels": "สลับตำแหน่งเริ่มต้นในด่านต่างๆ",
        "Automatically adjusts the settings of a startpos to correctly set the gamemode, speed, and more": "ปรับการตั้งค่าของสตาร์ตพอสโดยอัตโนมัติเพื่อตั้งค่าโหมดเกม ความเร็ว และอื่นๆ อย่างถูกต้อง",
        "Customize the time taken to respawn": "ปรับแต่งเวลาที่ใช้ในการเกิดใหม่",
        "Restarts the level instantly upon death": "เริ่มด่านใหม่ทันทีเมื่อตาย",
        "Shows object hitboxes": "แสดงกล่องการโจมตีของวัตถุ",
        "Creates a trail behind the player with its hitbox": "สร้างเส้นทางด้านหลังผู้เล่นพร้อมกับกล่องการโจมตี",
        "Makes the outline around the hitboxes thicker": "สร้างโครงร่างรอบกล่องการโจมตี หนากว่า",
        "Fills the hitboxes as well as outlining them": "เติม hitboxes รวมไปถึงการร่างโครงร่างด้วย",
        "Shows object hitboxes on death": "แสดง hitboxes ของอ็อบเจกต์เมื่อตาย",
        "Force Platformer mode on all levels.\nReopen level to apply.": "บังคับโหมดแพลตฟอร์มในทุกด่าน \nเปิดด่านใหม่เพื่อใช้",
        "Draws a line to secret / user coins in the level": "วาดเส้นเพื่อซ่อน/ใช้เหรียญในด่าน",
        "Disables mirror portals, only bad players use this": "ปิดใช้งานมิเรอร์พอร์ทัล ผู้เล่นที่เล่นไม่ดีเท่านั้นที่ใช้สิ่งนี้",
        "Makes the mirror portal transition instant": "ทำให้การเปลี่ยนมิเรอร์พอร์ทัลเกิดขึ้นทันที",
        "Allows you to have any amount of decimal places in your percentage text": "ให้คุณมีตำแหน่งทศนิยมเท่าใดก็ได้ในข้อความเปอร์เซ็นต์ของคุณ",
        "Percentage is calculated like in 2.1, The percentage for new best is still calculated like 2.2": "เปอร์เซ็นต์จะคำนวณเหมือนใน 2.1 เปอร์เซ็นต์สำหรับสิ่งที่ดีที่สุดใหม่จะคำนวณเหมือนใน 2.2",
        "Shows the layout of the level, its as <cr>simple</c> as that": "แสดงเค้าโครงของด่าน มันเหมือนกับ<cr>ง่าย</c> นั่นแหละ",
        "Keeps the 2.2 camera triggers in the level": "คงทริกเกอร์กล้องของ 2.2 ไว้ในด่าน",
        "Shows the triggers in normal mode like you're playtesting": "แสดงทริกเกอร์ในโหมดปกติเหมือนกับว่าคุณกำลังทดสอบการเล่น",
        "Adds a button to open the quests menu in the pause menu": "เพิ่มปุ่มเพื่อเปิดเมนูภารกิจในเมนูหยุดชั่วคราว",
        "Shows the players trajectory, This is broken for Ship and Ufo, in those gamemodes the trajectory may disappear unexpectedly": "แสดงเส้นทางการเคลื่อนที่ของผู้เล่น ซึ่งใช้กับยานและยูเอฟโอไม่ได้ ในโหมดเกมเหล่านี้ เส้นทางการเคลื่อนที่อาจหายไปโดยไม่คาดคิด",
        "Allows all gamemodes in platformer mode": "อนุญาตให้ใช้โหมดเกมทั้งหมดในโหมดเกมแพลตฟอร์ม",
        "Sets the seed for random triggers to a value of your choice": "ตั้งค่าเริ่มต้นสำหรับทริกเกอร์แบบสุ่มเป็นค่าที่คุณเลือก",
        "Shows the retry level popup ONLY when you get a new best": "แสดงป๊อปอัประดับการลองใหม่เฉพาะเมื่อคุณได้ระดับที่ดีที่สุดใหม่เท่านั้น",
        "Automatically puts you into practice mode when you open a level": "นำคุณเข้าสู่โหมดฝึกฝนโดยอัตโนมัติเมื่อคุณเปิดระดับ",
        "Kills the player after a set percentage": "ฆ่าผู้เล่นหลังจากเปอร์เซ็นต์ที่กำหนด",
        "Allows you to jump infinitely": "อนุญาตให้คุณกระโดดได้ไม่สิ้นสุด",
        "Shows a countdown for 3 seconds when you unpause a level": "แสดงการนับถอยหลัง 3 วินาทีเมื่อคุณยกเลิกการหยุดชั่วคราวระดับ",
        "Allows you to complete a level in practice mode if you beat it in <cr>one</c> attempt": "อนุญาตให้คุณผ่านระดับในโหมดฝึกฝนได้หากคุณเอาชนะได้ <cr>one</c> attempt",
        "Shows the best percentage in the progress bar": "แสดงเปอร์เซ็นต์ที่ดีที่สุดในแถบความคืบหน้า",
        "Automatically collect coins in level": "เก็บเหรียญโดยอัตโนมัติในระดับ",
        "Kills the player instantly": "ฆ่าผู้เล่นทันที",
        "Removes the 50 checkpoint limit from practice mode": "ลบขีดจำกัดจุดตรวจ 50 จากโหมดฝึกฝน",
        "Automatically clicks (and holds for) every X ticks": "คลิกอัตโนมัติ (และกดค้างไว้) ทุกๆ X ติ๊ก",
        "Should it click for player 1": "ควรคลิกสำหรับผู้เล่น 1",
        "Should it click for player 2": "ควรคลิกสำหรับผู้เล่น 2",
        "Stops triggers whenever you die :3": "หยุดทริกเกอร์ทุกครั้งที่คุณตาย :3",
        "Step the game through frames by tapping a button": "ก้าวผ่านเฟรมต่างๆ ด้วยการแตะปุ่ม",
        "this is here because i need a module for the popup": "นี่อยู่ที่นี่เพราะฉันต้องการโมดูลสำหรับป๊อปอัป",
        "Removes the fix for pause buffering (the old sakupen circles thing)": "ลบการแก้ไขสำหรับการหยุดบัฟเฟอร์ชั่วคราว (วงกลม sakupen แบบเก่า)",
        "Forces all players to be invisible": "บังคับให้ผู้เล่นทั้งหมดมองไม่เห็น",
        "Forces all players to be visible": "บังคับให้ผู้เล่นทั้งหมดมองเห็นได้",
        "Change the size of hotboxes": "เปลี่ยนขนาดของกล่องตัวเลือก",
        "Freezes your attempt count stat and on level": "หยุดสถิติจำนวนการพยายามของคุณและระดับ",
        "Disables static camera": "ปิดใช้งานกล้องคงที่",
        "Forces the level to have the upside down <cl>gravity bug</c> from before <cc>2.2</c>": "บังคับให้ระดับมี <cl>ข้อผิดพลาดแรงโน้มถ่วง</c> คว่ำลงจากก่อน <cc>2.2</c>",
        "Adds a button to open the icon kit in the pause menu": "เพิ่มปุ่มเพื่อเปิดชุดไอคอนในเมนูหยุดชั่วคราว",
        "Unlocks the Practice Music Sync button in the pause menu options": "ปลดล็อกปุ่มเพลงฝึกหัดซิงค์ในตัวเลือกเมนูหยุดชั่วคราว",
        "It... Unlocks all the icons, You should know what this does": "มัน... ปลดล็อกไอคอนทั้งหมด คุณควรรู้ว่าสิ่งนี้ทำอะไร",
        "Unlocks the menu and practice music buttons": "ปลดล็อกปุ่มเมนูและเพลงฝึกหัด",
        "Replaces every single sfx with\n<co>FIRE IN THE HOLE!</c>": "แทนที่เอฟเฟกต์เสียงทั้งหมดด้วย\n<cr>FIRE IN THE HOLE!</c>",
        "Automatically enables safe mode if you have cheats enabled": "เปิดใช้งานโหมดปลอดภัยโดยอัตโนมัติหากคุณเปิดใช้งานกลโกง",
        "Disables all progress on levels": "ปิดใช้งานความคืบหน้าทั้งหมดในระดับ",
        "Removes the <cl>character limit</c> on input fields": "ลบ <cl>ข้อจำกัดอักขระ</c> บนช่องป้อนข้อมูล",
        "Allows you to input <cg>any</c> character in input fields": "อนุญาตให้คุณป้อนข้อมูล <cg>อักขระใดก็ได้</c> ในช่องป้อนข้อมูล",
        "Allows you to play the main demon levels": "อนุญาตให้คุณเล่นด่านหลักปีศาจ",
        "Allows you to play the levels in the tower": "อนุญาตให้คุณเล่นด่านในหอคอย",
        "Automatically downloads songs when you open a level": "ดาวน์โหลดเพลงโดยอัตโนมัติเมื่อคุณเปิดด่าน",
        "Replaces the mini options menu in the pause menu with the full options menu": "แทนที่เมนูตัวเลือกขนาดเล็กในเมนูหยุดชั่วคราวด้วยเมนูตัวเลือกแบบเต็ม",
        "Allows your physics to run at values other than 240": "อนุญาตให้ฟิสิกส์ของคุณทำงานที่ค่าอื่นที่ไม่ใช่ 240",
        "Allows you to view the comment history of any user, rob still hasn't fixed this": "อนุญาตให้คุณดูประวัติความคิดเห็นของผู้ใช้ใดๆ ก็ได้ rob ยังไม่ได้แก้ไขปัญหานี้",
        "Allows sliders to go beyond the limit of the slider": "อนุญาตให้แถบเลื่อนไปเกินขีดจำกัดของแถบเลื่อน",
        "Adjust your scene transition": "ปรับการเปลี่ยนฉากของคุณ",
        "Shift the pitch of the game audio": "เปลี่ยนระดับเสียงของเสียงในเกม",
        "Show the full value instead of the short value in level cells": "แสดงค่าเต็มแทนค่าสั้นในเซลล์ด่าน",
        "Shows a circle on the screen whenever you touch": "แสดงวงกลมบนหน้าจอทุกครั้งที่คุณสัมผัส",
        "Automatically enable Low Detail Mode in levels when you view them": "เปิดใช้งานโหมดรายละเอียดต่ำโดยอัตโนมัติในด่านต่างๆ เมื่อคุณดู",
        "Hides the pause menu :3": "ซ่อนเมนูหยุดชั่วคราว :3",
        "Allows you to enter the treasure room without having <cc>5</c> demon keys": "อนุญาตให้คุณเข้าสู่ห้องสมบัติโดยไม่ต้องมีกุญแจปีศาจ <cc>5</c> ดอก",
        "Allows you to enter the vault of secrets without having <cc>50</c> diamonds": "อนุญาตให้คุณเข้าสู่ห้องนิรภัยแห่งความลับโดยไม่ต้องมีเพชร <cc>50</c> ดอ",
        "Allows you to enter the monsters basement without completing <cc>The Challenge</c>": "อนุญาตให้คุณเข้าสู่ห้องใต้ดินของมอนสเตอร์โดยไม่ต้องทำ <cc>The Challenge</c> ให้สำเร็จ",
        "Allows you to unlock the keys in the monsters basement": "อนุญาตให้คุณปลดล็อกกุญแจในห้องใต้ดินของมอนสเตอร์",
        "Allows you to open any chest in the <cc>treasure room</c>": "อนุญาตให้คุณเปิดหีบใดๆ ใน <cc>ห้องสมบัติ</c> ให้สำเร็จ",
        "Allows you to open any level in the gauntlet": "อนุญาตให้คุณเปิดด่านใดๆ ในด่านท้าทาย",
        "Shows snow on the main menu during <cc>december</c>.": "แสดงหิมะบนเมนูหลักในช่วง <cc>เดือนธันวาคม</c>",
        "Shows the cheat indicator on the <cc>end screen</c>.": "แสดงตัวบ่งชี้การโกงบน<cc>หน้าจอสิ้นสุด</c>",
        "Allows you to copy any level from the servers\nCode by <co>Firee</c>": "อนุญาตให้คุณคัดลอกด่านใดๆ จากเซิร์ฟเวอร์\nCode โดย <co>Firee</c>",
        "Adds a button to the password input popup that shows the level password": "เพิ่มปุ่มลงในป๊อปอัปการป้อนรหัสผ่านซึ่งจะแสดงรหัสผ่านระดับ",
        "Hides the (c) mark from your levels on publish.\nCode by <co>Firee</c>": "ซ่อนเครื่องหมาย (c) จากระดับของคุณเมื่อเผยแพร่\nโค้ดโดย <co>Firee</c>",
        "Allows you to edit any level": "อนุญาตให้คุณอัปโหลดระดับโดยไม่ต้องตรวจสอบ",
        "Lets you upload levels without verifying them": "ลบข้อจำกัดเพลงระดับหลัก",
        "Removes the main level song limit": "อนุญาตให้คุณเลื่อนผ่านข้อจำกัดของตัวแก้ไข",
        "Allows you to scroll past the limits of the editor": "ลบข้อจำกัดของอ็อบเจกต์ที่กำหนดเอง",
        "Removes the custom object limit": "ลบข้อจำกัดของวัตถุที่กำหนดเอง",
        "Shows the wave trail in the editor": "แสดงเส้นทางคลื่นในตัวแก้ไข",
        "Updates the editor trail at your screen refresh rate instead of 30 fps": "อัปเดตเส้นทางของตัวแก้ไขตามอัตราการรีเฟรชหน้าจอของคุณแทนที่จะเป็น 30 fps",
        "Increases the length of the editor by <cs>17895</c> times :3": "เพิ่มความยาวของตัวแก้ไข <cs>17895</c> ครั้ง XDDDDD",
        "Unlimited <cc>Rows</c> and <cc>Columns</c> in your <cl>Object Toolbox</c>": "จำนวน <cc>แถว</c> และ <cc>คอลัมน์</c> ไม่จำกัดใน <cl>กล่องเครื่องมืออ็อบเจกต์</c> ของคุณ",
        "Adds an input field to the object scale control": "รีเซ็ต <cc>เปอร์เซ็นต์</c> บน <cl>ระดับท้องถิ่น</c> เมื่อใดก็ตามที่คุณบันทึกในโปรแกรมแก้ไข",
        "Resets <cc>percentage</c> on <cl>local levels</c> whenever you save in the editor": "รีเซ็ต <cc>เปอร์เซ็นต์</c> บน <cl>ระดับท้องถิ่น</c> เมื่อใดก็ตามที่คุณบันทึกในโปรแกรมแก้ไ",
        "Disables the fade scene transitions": "ปิดใช้งานการเปลี่ยนฉากแบบเฟด",
        "Disables camera shake globally": "ปิดใช้งานการสั่นของกล้องโดยรวม",
        "Disables shaders, <cl>maybe read</c> the name": "ปิดใช้งานเชเดอร์ <cl>อาจอ่าน</c> ชื่อ",
        "Disables the death effect on the player": "ปิดใช้งานเอฟเฟกต์ความตายบนผู้เล่น",
        "Disables the wave trail": "ปิดใช้งานเส้นทางคลื่น",
        "Makes the wave trail a solid colour": "ทำให้เส้นทางคลื่นเป็นสีทึบ",
        "Disables the colouring on the gradient backgrounds": "ปิดใช้งานการลงสีบนพื้นหลังแบบไล่ระดับ",
        "Disables the colouring on all cells": "ปิดใช้งานการลงสีบนเซลล์ทั้งหมด",
        "Forces the trail on": "บังคับให้เส้นทางเปิด",
        "Forces the trail off": "บังคับให้เส้นทางปิด",
        "Forces the ghost trail on": "บังคับให้เส้นทางผีเปิด",
        "Forces the ghost trail off": "บังคับให้เส้นทางผีปิด",
        "Disables Object Glow": "ปิดใช้งานการเรืองแสงของวัตถุ",
        "Disables the blinking when the player respawns": "ปิดใช้งานการกะพริบเมื่อผู้เล่นเกิดใหม่",
        "Disables circle effects such as the one when you touch an orb": "ปิดใช้งานเอฟเฟกต์วงกลม เช่น เมื่อคุณสัมผัสทรงกลม",
        "Disables wave pulse": "ปิดใช้งานคลื่นพัลส์",
        "Pulses the <cg>Geometry Dash</c> logo on the main menu to the music": "ทำให้โลโก้ <cg>Geometry Dash</c> บนเมนูหลักเป็นจังหวะ music",
        "Disables the attempt text and endscreen text from being flipped with the <cl>Do Not</c> option enabled.": "ปิดข้อความพยายามและข้อความหน้าจอท้ายไม่ให้พลิกกลับเมื่อเปิดใช้งานตัวเลือก <cl>Do Not</c>",
        "Disables rotation on players": "ปิดการหมุนของผู้เล่น",
        "Disables particles, seems pretty obvious what this does imo": "ปิดประกาย ดูเหมือนจะชัดเจนมากว่าสิ่งนี้ทำอะไร",
        "Disables the level visually, good for hitbox only showcases ig": "ปิดการแสดงระดับ ดีสำหรับ hitbox เท่านั้น แสดง ฉันคิดว่า",
        "Visually Unlocks the greyed out buttons in the online page": "ปิดออร์บไม่ให้เต้นเป็นจังหวะ ไม่ทำงานบนระดับหลักที่สร้างก่อน 2.2",
        "Stops the wave trail from disappearing when you change gamemode": "หยุดไม่ให้เส้นคลื่นหายไปเมื่อคุณเปลี่ยนโหมดเกม",
        "Disables orb's from pulsing, Doesn't work on main levels made before 2.2": "ปิดการใช้งานออร์บจากการเต้นเป็นจังหวะ ไม่ทำงานบนเลเวลหลักที่สร้างก่อน 2.2, не працює на основних рівнях, створених до 2.2",
        "Allows you to control the icons on the main menu.\nI honestly have no idea what category to put it in so its cosmetic now :3": "อนุญาตให้คุณควบคุมไอคอนบนเมนูหลัก\nฉันไม่มีไอเดียจริงๆ ว่าจะใส่ไว้ในหมวดหมู่ไหน ดังนั้นตอนนี้มันจึงกลายเป็นเครื่องสำอาง :3",
        "Hides the pause button in game, requires reopening level to apply": "ซ่อนปุ่มหยุดชั่วคราวในเกม ต้องเปิดระดับใหม่อีกครั้งจึงจะใช้ได้",
        "Allows you to visually collect coins in practice mode": "อนุญาตให้คุณเก็บเหรียญด้วยภาพใน โหมดฝึกฝน",
        "Hides the fire under the robot while it's boosting": "ซ่อนเอฟเฟกต์แมงมุมพุ่งเมื่อคุณเทเลพอร์ต",
        "Hides the spider dash effect when you teleport": "ซ่อนไฟไว้ใต้หุ่นยนต์ขณะที่กำลังเร่งความเร็ว",
        "Lengthens your player's trail length by a factor of 3x": "เพิ่มความยาวของเส้นทางของผู้เล่นเป็น 3 เท่า",
        "Hides the fire behind your icon when using a dash orb": "ซ่อนไฟไว้หลังไอคอนของคุณเมื่อใช้ลูกแก้วพุ่ง",
        "Makes user coins appear as if they are gold robtop coins": "ทำให้เหรียญของผู้ใช้ปรากฏราวกับว่าเป็นเหรียญทองของโรบท็อป",
        "Hides the fire behind the ship while it's flying": "ซ่อนไฟไว้หลังเรือในขณะที่กำลังบิน",
        "EMULATES the old rotation bug when switching gamemodes from the ball": "เลียนแบบจุดบกพร่องของการหมุนแบบเก่าเมื่อสลับโหมดเกมจากลูกบอล",
        "Disables blending on the normal player trail": "ปิดใช้งานการผสมบนเส้นทางของผู้เล่นปกติ",
        "Changes the font of the <cc>percentage / time</c> label to be the <cl>level font</c>": "เปลี่ยนแบบอักษรของป้ายกำกับ <cc>เปอร์เซ็นต์ / เวลา</c> ให้เป็น <cl>แบบอักษรระดับ</c>",
        "Disables the squish animation when jumping in <cc>platformer mode</c>": "ปิดใช้งานแอนิเมชั่นการกระแทกเมื่อกระโดดใน <cc>โหมดแพลตฟอร์ม</c>",
        "Disables the lightning when touching certain portals": "ปิดใช้งานสายฟ้าเมื่อสัมผัสบางอย่าง พอร์ทัล",
        "Speed modifier (*)": "ตัวปรับแต่งความเร็ว (*)",
        "Is the speedhack enabled?": "เปิดใช้งาน speedhack หรือยัง",
        "Speedhack all sound by your speed modifier": "Speedhack จะส่งเสียงทั้งหมดตามตัวปรับแต่งความเร็วของคุณ",
        "Only enables the speedhack in gameplay and editor": "เปิดใช้งาน speedhack เฉพาะในเกมเพลย์และโปรแกรมแก้ไขเท่านั้น",
        "Adds a search box to the bottom of the ui instead of <cc>version info</c>.": "เพิ่มช่องค้นหาที่ด้านล่างของ UI แทน <cc>ข้อมูลเวอร์ชัน</c>",
        "Adds borders to the left and right sides of the mod menu to make the menu look better with some texture packs\nlike the <cg>npesta</c> pack": "เพิ่มขอบที่ด้านซ้ายและด้านขวาของเมนู mod เพื่อให้เมนูดูดีขึ้นด้วยแพ็คพื้นผิวบางอย่าง เช่น แพ็ค <cg>npesta</c>",
        "Blurs the background of the mod menu": "เบลอพื้นหลังของเมนู mod",
        "Hides the button to open the menu, use the <cl>Tab</c> or <cl>Insert</c> key to open the mod menu": "ซ่อนปุ่มเพื่อเปิดเมนู ใช้ <cl>Tab</c> หรือ <cl>Insert</c> เพื่อเปิดเมนู mod",
        "Allow dragging the ball on screen": "อนุญาตให้ลากลูกบอลบนหน้าจอ",
        "Saves the position of the ball on screen between sessions": "บันทึกตำแหน่งของลูกบอลบนหน้าจอระหว่างเซสชัน",
        "Makes the mod menu button fade instantly": "ทำให้ปุ่มเมนู mod จางลงทันที"
    }
}